# Pandas

In [2]:
#création d'une dataframe à partir d'un dictionnaire
import pandas as pd
metiers     = [ 'journaliste', 'capitaine']
noms        = ['tintin', 'hadock' ]
personnages = { 'metiers' : metiers , 'noms'    : noms   }

df = pd.DataFrame(personnages)
df

       metiers    noms
0  journaliste  tintin
1    capitaine  hadock

In [3]:
#Infos sur la dataframe
print "shape   = ", df.shape
print "columns = ", df.columns # les colonnes sont les clefs du dico
print "metiers = ", df['metiers']
print "type de colonne = ", type(df['metiers']) # une colonne est une série

shape   =  (2, 2)
columns =  Index([u'metiers', u'noms'], dtype='object')
metiers =  0    journaliste
1      capitaine
Name: metiers, dtype: object
type de colonne =  <class 'pandas.core.series.Series'>

In [4]:
# Ajout d'une colonne
ages       = [84, 81]
df['age']  = ages
df

       metiers    noms  age
0  journaliste  tintin   84
1    capitaine  hadock   81

In [5]:
#manipulation de l'index
df.index      = [ "heros", "secondaire" ]
df.index.name = 'type'
df

                metiers    noms  age
type
heros       journaliste  tintin   84
secondaire    capitaine  hadock   81

In [6]:
# creation d'un index temporel
dates = pd.date_range( start = "01/01/1931" ,  end  =  "01/02/1931" )
df.index = dates
df

                metiers    noms  age
1931-01-01  journaliste  tintin   84
1931-01-02    capitaine  hadock   81

In [7]:
# creation d'une seconde dataframe
bds = pd.DataFrame({ 'titre' : ['Au congo',  'Cigares pharaon'],
                   'Origine' : ['France',  'France']} )
# affectation du même index temporelle
bds.index = dates
bds

           Origine            titre
1931-01-01  France         Au congo
1931-01-02  France  Cigares pharaon

In [8]:
#usage de l'index pour ajouter une colonne
df["titre"] = bds["titre"]
df

                metiers    noms  age            titre
1931-01-01  journaliste  tintin   84         Au congo
1931-01-02    capitaine  hadock   81  Cigares pharaon

In [9]:
#ajout des lignes de l'une dans l'autre
# crée des NaN et des colonnes 
# + redondance d'index
new_df_2 = df.append(bds) 
new_df_2

           Origine   age      metiers    noms            titre
1931-01-01     NaN  84.0  journaliste  tintin         Au congo
1931-01-02     NaN  81.0    capitaine  hadock  Cigares pharaon
1931-01-01  France   NaN          NaN     NaN         Au congo
1931-01-02  France   NaN          NaN     NaN  Cigares pharaon

In [10]:
# merge "latéral" en se basant sur l'index temporel
new_df_1 = df.merge(bds)
new_df_1

       metiers    noms  age            titre Origine
0  journaliste  tintin   84         Au congo  France
1    capitaine  hadock   81  Cigares pharaon  France

In [11]:
# concaténation en conservant l'index temporel
# (on utilise pandas ! et non les df)
new_df_3 = pd.concat([df, bds], axis=1)
new_df_3

                metiers    noms  age            titre Origine            titre
1931-01-01  journaliste  tintin   84         Au congo  France         Au congo
1931-01-02    capitaine  hadock   81  Cigares pharaon  France  Cigares pharaon

In [12]:

new_df_3

                metiers    noms  age            titre Origine            titre
1931-01-01  journaliste  tintin   84         Au congo  France         Au congo
1931-01-02    capitaine  hadock   81  Cigares pharaon  France  Cigares pharaon

In [19]:
dates = pd.date_range( start = "01/01/1931" ,  end  =  "01/02/1941" )
new_df_4 = new_df_3.reindex(dates)
new_df_4.head()

,metiers,noms,age,titre,Origine,titre
1931-01-01,journaliste,tintin,84.0,Au congo,France,Au congo
1931-01-02,capitaine,hadock,81.0,Cigares pharaon,France,Cigares pharaon
1931-01-03,NaN,NaN,NaN,NaN,NaN,NaN
1931-01-04,NaN,NaN,NaN,NaN,NaN,NaN
1931-01-05,NaN,NaN,NaN,NaN,NaN,NaN

# Dans une dataframe temporelle
# On peut sélectionner un groupe de lignes 
# Avec un sélecteur de temps qui en comprend plusieurs

In [22]:
new_df_4["1931-10"].head() # sélection des lignes du mois d'octobre

           metiers noms  age titre Origine titre
1931-10-01     NaN  NaN  NaN   NaN     NaN   NaN
1931-10-02     NaN  NaN  NaN   NaN     NaN   NaN
1931-10-03     NaN  NaN  NaN   NaN     NaN   NaN
1931-10-04     NaN  NaN  NaN   NaN     NaN   NaN
1931-10-05     NaN  NaN  NaN   NaN     NaN   NaN

# Si on veut sélectionne une ligne on doit utiliser la fonction iloc

In [27]:
new_df_4.loc["1931-10-02"] # sélection des lignes du mois d'octobre

metiers    NaN
noms       NaN
age        NaN
titre      NaN
Origine    NaN
titre      NaN
Name: 1931-10-02 00:00:00, dtype: object